dlls/ProductDetailsRequestTemplate.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><SearchWithNifEnabled xmlns="http://schemas.microsoft.com/MobileSearch/v1/Search"><request xmlns:a="http://schemas.microsoft.com/MobileSearch/v1/Search/metadata" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:Context><a:ApplicationId>%1</a:ApplicationId><a:Culture>%4</a:Culture><a:UserId>%2</a:UserId><a:Version>%3</a:Version></a:Context><a:Queries><a:QueryInformation><a:Domains><a:DomainInformation><a:Domain>Product</a:Domain><a:Detail><a:Id>%5</a:Id><a:Product><a:Offer><a:Refinement><a:SortByOptions><a:SortByOption><a:InternalParameters/><a:SortByAttributeName>PriceAscending</a:SortByAttributeName><a:SortByOrder>0</a:SortByOrder><a:SortByValue>priceasc</a:SortByValue></a:SortByOption></a:SortByOptions></a:Refinement></a:Offer><a:RequestTypes><a:ProductDetailRequestType>ProductInfo</a:ProductDetailRequestType><a:ProductDetailRequestType>ProductSpec</a:ProductDetailRequestType><a:ProductDetailRequestType>Offer</a:ProductDetailRequestType><a:ProductDetailRequestType>Review</a:ProductDetailRequestType><a:ProductDetailRequestType>ExpertReview</a:ProductDetailRequestType></a:RequestTypes><a:Review><a:Refinement><a:SortByOptions><a:SortByOption><a:InternalParameters/><a:SortByAttributeName>DateDescending</a:SortByAttributeName><a:SortByOrder>1</a:SortByOrder><a:SortByValue>datedesc</a:SortByValue></a:SortByOption></a:SortByOptions></a:Refinement></a:Review></a:Product></a:Detail></a:DomainInformation></a:Domains><a:QueryString/></a:QueryInformation></a:Queries></request></SearchWithNifEnabled></s:Body></s:Envelope>
